# Set global configuration arguments
cask_args appdir: "/Applications"

# Taps
tap "homebrew/cask"
tap "homebrew/cask-fonts"

# System set up
brew "bat"
brew "colordiff"
brew "coreutils"  # Those that come with macOS are outdated
brew "curl"
brew "git"
brew "grep"
brew "mas"
brew "rsync"
brew "wget"

# Fonts
cask "font-meslo-lg-nerd-font"  # Used for vim-devicons plugin

# Programming languages / Development
brew "mysql"
brew "node"
brew "pyenv"
brew "yarn"

# Shell
cask "iterm2"
brew "fzf"
brew "luajit", args: ['HEAD']
brew "luarocks"
brew "neovim", args: ['HEAD']
brew "ripgrep"
brew "thefuck"
brew "tmux"
brew "zsh"

# Install applications
cask "google-chrome"
cask "messenger"
cask "notion"
cask "rectangle"
cask "slack"
cask "spotify"
cask "sublime-text"
cask "visual-studio-code"
cask "zoom"

# Install MAS applications
mas "Spark", id: 1176895641
